Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
ParameterGuid
Retrieves a parameter from the element given a GUID for a shared parameter.
ParameterBuiltInParameter
Retrieves a parameter from the element given a parameter id.
ParameterDefinition
Retrieves a parameter from the element based on its definition.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →